import React from "react";
import { Button } from "react-bootstrap";
import "./HeroSection.css"; // Убедитесь, что путь к файлу CSS правильный
import { useInView } from "react-intersection-observer"; // Необходимо установить react-intersection-observer

const HeroSection = () => {
  const { ref, inView } = useInView({
    /* Опции, например, threshold: 0.1, означает, что эффект сработает, когда элемент появится на 10% */
    triggerOnce: true, // Эффект сработает только один раз при первом появлении
  });

  return (
    <section id="hero" ref={ref} className={inView ? "fade-in" : ""}>
      <div className="hero-content">
        <h2>О нас</h2>
        <p>
          Мы - профессиональный поставщик промышленной электроники. Наша
          компания специализируется на продаже широкого ассортимента
          оборудования, компонентов и систем промышленной электроники. Мы
          предлагаем высококачественные продукты, которые предназначены для
          использования в промышленных отраслях, таких как производство,
          энергетика, автоматизация, обработка данных и многое другое. Наш
          ассортимент включает в себя электронные приборы, контроллеры, панели
          управления, сенсоры, преобразователи сигналов, промышленные компьютеры
          и другие продукты, необходимые для эффективной работы промышленных
          процессов.
        </p>
        <Button variant="outline-primary">Узнать больше</Button>
      </div>
    </section>
  );
};

export default HeroSection;
